GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.h
// Register: DMA2DCNT
#define DMA2DCNT DMA2DCNT
extern volatile unsigned short          DMA2DCNT            __at(0x3BCA);
#ifndef _LIB_BUILD
asm("DMA2DCNT equ 03BCAh");
#endif

// Register: DMA2DCNTL
#define DMA2DCNTL DMA2DCNTL
extern volatile unsigned char           DMA2DCNTL           __at(0x3BCA);
#ifndef _LIB_BUILD
asm("DMA2DCNTL equ 03BCAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :8;
    };
    struct {
        unsigned DCNT0                  :1;
        unsigned DCNT1                  :1;
        unsigned DCNT2                  :1;
        unsigned DCNT3                  :1;
        unsigned DCNT4                  :1;
        unsigned DCNT5                  :1;
        unsigned DCNT6                  :1;
        unsigned DCNT7                  :1;
    };
    struct {
        unsigned DMA2DCNT               :8;
    };
    struct {
        unsigned DMA2DCNT0              :1;
        unsigned DMA2DCNT1              :1;
        unsigned DMA2DCNT2              :1;
        unsigned DMA2DCNT3              :1;
        unsigned DMA2DCNT4              :1;
        unsigned DMA2DCNT5              :1;
        unsigned DMA2DCNT6              :1;
        unsigned DMA2DCNT7              :1;
    };
} DMA2DCNTLbits_t;
extern volatile DMA2DCNTLbits_t DMA2DCNTLbits __at(0x3BCA);
// bitfield macros
#define _DMA2DCNTL_DCNT_POSN                                0x0
#define _DMA2DCNTL_DCNT_POSITION                            0x0
#define _DMA2DCNTL_DCNT_SIZE                                0x8
#define _DMA2DCNTL_DCNT_LENGTH                              0x8
#define _DMA2DCNTL_DCNT_MASK                                0xFF
#define _DMA2DCNTL_DCNT0_POSN                               0x0
#define _DMA2DCNTL_DCNT0_POSITION                           0x0
#define _DMA2DCNTL_DCNT0_SIZE                               0x1
#define _DMA2DCNTL_DCNT0_LENGTH                             0x1
#define _DMA2DCNTL_DCNT0_MASK                               0x1
#define _DMA2DCNTL_DCNT1_POSN                               0x1
#define _DMA2DCNTL_DCNT1_POSITION                           0x1
#define _DMA2DCNTL_DCNT1_SIZE                               0x1
#define _DMA2DCNTL_DCNT1_LENGTH                             0x1
#define _DMA2DCNTL_DCNT1_MASK                               0x2
#define _DMA2DCNTL_DCNT2_POSN                               0x2
#define _DMA2DCNTL_DCNT2_POSITION                           0x2
#define _DMA2DCNTL_DCNT2_SIZE                               0x1
#define _DMA2DCNTL_DCNT2_LENGTH                             0x1
#define _DMA2DCNTL_DCNT2_MASK                               0x4
#define _DMA2DCNTL_DCNT3_POSN                               0x3
#define _DMA2DCNTL_DCNT3_POSITION                           0x3
#define _DMA2DCNTL_DCNT3_SIZE                               0x1
#define _DMA2DCNTL_DCNT3_LENGTH                             0x1
#define _DMA2DCNTL_DCNT3_MASK                               0x8
#define _DMA2DCNTL_DCNT4_POSN                               0x4
#define _DMA2DCNTL_DCNT4_POSITION                           0x4
#define _DMA2DCNTL_DCNT4_SIZE                               0x1
#define _DMA2DCNTL_DCNT4_LENGTH                             0x1
#define _DMA2DCNTL_DCNT4_MASK                               0x10
#define _DMA2DCNTL_DCNT5_POSN                               0x5
#define _DMA2DCNTL_DCNT5_POSITION                           0x5
#define _DMA2DCNTL_DCNT5_SIZE                               0x1
#define _DMA2DCNTL_DCNT5_LENGTH                             0x1
#define _DMA2DCNTL_DCNT5_MASK                               0x20
#define _DMA2DCNTL_DCNT6_POSN                               0x6
#define _DMA2DCNTL_DCNT6_POSITION                           0x6
#define _DMA2DCNTL_DCNT6_SIZE                               0x1
#define _DMA2DCNTL_DCNT6_LENGTH                             0x1
#define _DMA2DCNTL_DCNT6_MASK                               0x40
#define _DMA2DCNTL_DCNT7_POSN                               0x7
#define _DMA2DCNTL_DCNT7_POSITION                           0x7
#define _DMA2DCNTL_DCNT7_SIZE                               0x1
#define _DMA2DCNTL_DCNT7_LENGTH                             0x1
#define _DMA2DCNTL_DCNT7_MASK                               0x80
#define _DMA2DCNTL_DMA2DCNT_POSN                            0x0
#define _DMA2DCNTL_DMA2DCNT_POSITION                        0x0
#define _DMA2DCNTL_DMA2DCNT_SIZE                            0x8
#define _DMA2DCNTL_DMA2DCNT_LENGTH                          0x8
#define _DMA2DCNTL_DMA2DCNT_MASK                            0xFF
#define _DMA2DCNTL_DMA2DCNT0_POSN                           0x0
#define _DMA2DCNTL_DMA2DCNT0_POSITION                       0x0
#define _DMA2DCNTL_DMA2DCNT0_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT0_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT0_MASK                           0x1
#define _DMA2DCNTL_DMA2DCNT1_POSN                           0x1
#define _DMA2DCNTL_DMA2DCNT1_POSITION                       0x1
#define _DMA2DCNTL_DMA2DCNT1_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT1_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT1_MASK                           0x2
#define _DMA2DCNTL_DMA2DCNT2_POSN                           0x2
#define _DMA2DCNTL_DMA2DCNT2_POSITION                       0x2
#define _DMA2DCNTL_DMA2DCNT2_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT2_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT2_MASK                           0x4
#define _DMA2DCNTL_DMA2DCNT3_POSN                           0x3
#define _DMA2DCNTL_DMA2DCNT3_POSITION                       0x3
#define _DMA2DCNTL_DMA2DCNT3_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT3_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT3_MASK                           0x8
#define _DMA2DCNTL_DMA2DCNT4_POSN                           0x4
#define _DMA2DCNTL_DMA2DCNT4_POSITION                       0x4
#define _DMA2DCNTL_DMA2DCNT4_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT4_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT4_MASK                           0x10
#define _DMA2DCNTL_DMA2DCNT5_POSN                           0x5
#define _DMA2DCNTL_DMA2DCNT5_POSITION                       0x5
#define _DMA2DCNTL_DMA2DCNT5_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT5_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT5_MASK                           0x20
#define _DMA2DCNTL_DMA2DCNT6_POSN                           0x6
#define _DMA2DCNTL_DMA2DCNT6_POSITION                       0x6
#define _DMA2DCNTL_DMA2DCNT6_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT6_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT6_MASK                           0x40
#define _DMA2DCNTL_DMA2DCNT7_POSN                           0x7
#define _DMA2DCNTL_DMA2DCNT7_POSITION                       0x7
#define _DMA2DCNTL_DMA2DCNT7_SIZE                           0x1
#define _DMA2DCNTL_DMA2DCNT7_LENGTH                         0x1
#define _DMA2DCNTL_DMA2DCNT7_MASK                           0x80

// Register: DMA2DCNTH
#define DMA2DCNTH DMA2DCNTH
extern volatile unsigned char           DMA2DCNTH           __at(0x3BCB);
#ifndef _LIB_BUILD
asm("DMA2DCNTH equ 03BCBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DCNT                   :4;
    };
    struct {
        unsigned DCNT8                  :1;
        unsigned DCNT9                  :1;
        unsigned DCNT10                 :1;
        unsigned DCNT11                 :1;
    };
    struct {
        unsigned DMA2SCNT               :4;
    };
    struct {
        unsigned DMA2DCNT8              :1;
        unsigned DMA2DCNT9              :1;
        unsigned DMA2DCNT10             :1;
        unsigned DMA2DCNT11             :1;
    };
} DMA2DCNTHbits_t;
