GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.h
extern volatile SMT1PRHbits_t SMT1PRHbits __at(0x3F1C);
// bitfield macros
#define _SMT1PRH_PR_POSN                                    0x0
#define _SMT1PRH_PR_POSITION                                0x0
#define _SMT1PRH_PR_SIZE                                    0x8
#define _SMT1PRH_PR_LENGTH                                  0x8
#define _SMT1PRH_PR_MASK                                    0xFF
#define _SMT1PRH_PR8_POSN                                   0x0
#define _SMT1PRH_PR8_POSITION                               0x0
#define _SMT1PRH_PR8_SIZE                                   0x1
#define _SMT1PRH_PR8_LENGTH                                 0x1
#define _SMT1PRH_PR8_MASK                                   0x1
#define _SMT1PRH_PR9_POSN                                   0x1
#define _SMT1PRH_PR9_POSITION                               0x1
#define _SMT1PRH_PR9_SIZE                                   0x1
#define _SMT1PRH_PR9_LENGTH                                 0x1
#define _SMT1PRH_PR9_MASK                                   0x2
#define _SMT1PRH_PR10_POSN                                  0x2
#define _SMT1PRH_PR10_POSITION                              0x2
#define _SMT1PRH_PR10_SIZE                                  0x1
#define _SMT1PRH_PR10_LENGTH                                0x1
#define _SMT1PRH_PR10_MASK                                  0x4
#define _SMT1PRH_PR11_POSN                                  0x3
#define _SMT1PRH_PR11_POSITION                              0x3
#define _SMT1PRH_PR11_SIZE                                  0x1
#define _SMT1PRH_PR11_LENGTH                                0x1
#define _SMT1PRH_PR11_MASK                                  0x8
#define _SMT1PRH_PR12_POSN                                  0x4
#define _SMT1PRH_PR12_POSITION                              0x4
#define _SMT1PRH_PR12_SIZE                                  0x1
#define _SMT1PRH_PR12_LENGTH                                0x1
#define _SMT1PRH_PR12_MASK                                  0x10
#define _SMT1PRH_PR13_POSN                                  0x5
#define _SMT1PRH_PR13_POSITION                              0x5
#define _SMT1PRH_PR13_SIZE                                  0x1
#define _SMT1PRH_PR13_LENGTH                                0x1
#define _SMT1PRH_PR13_MASK                                  0x20
#define _SMT1PRH_PR14_POSN                                  0x6
#define _SMT1PRH_PR14_POSITION                              0x6
#define _SMT1PRH_PR14_SIZE                                  0x1
#define _SMT1PRH_PR14_LENGTH                                0x1
#define _SMT1PRH_PR14_MASK                                  0x40
#define _SMT1PRH_PR15_POSN                                  0x7
#define _SMT1PRH_PR15_POSITION                              0x7
#define _SMT1PRH_PR15_SIZE                                  0x1
#define _SMT1PRH_PR15_LENGTH                                0x1
#define _SMT1PRH_PR15_MASK                                  0x80
#define _SMT1PRH_SMT1PR_POSN                                0x0
#define _SMT1PRH_SMT1PR_POSITION                            0x0
#define _SMT1PRH_SMT1PR_SIZE                                0x8
#define _SMT1PRH_SMT1PR_LENGTH                              0x8
#define _SMT1PRH_SMT1PR_MASK                                0xFF
#define _SMT1PRH_SMT1PR8_POSN                               0x0
#define _SMT1PRH_SMT1PR8_POSITION                           0x0
#define _SMT1PRH_SMT1PR8_SIZE                               0x1
#define _SMT1PRH_SMT1PR8_LENGTH                             0x1
#define _SMT1PRH_SMT1PR8_MASK                               0x1
#define _SMT1PRH_SMT1PR9_POSN                               0x1
#define _SMT1PRH_SMT1PR9_POSITION                           0x1
#define _SMT1PRH_SMT1PR9_SIZE                               0x1
#define _SMT1PRH_SMT1PR9_LENGTH                             0x1
#define _SMT1PRH_SMT1PR9_MASK                               0x2
#define _SMT1PRH_SMT1PR10_POSN                              0x2
#define _SMT1PRH_SMT1PR10_POSITION                          0x2
#define _SMT1PRH_SMT1PR10_SIZE                              0x1
#define _SMT1PRH_SMT1PR10_LENGTH                            0x1
#define _SMT1PRH_SMT1PR10_MASK                              0x4
#define _SMT1PRH_SMT1PR11_POSN                              0x3
#define _SMT1PRH_SMT1PR11_POSITION                          0x3
#define _SMT1PRH_SMT1PR11_SIZE                              0x1
#define _SMT1PRH_SMT1PR11_LENGTH                            0x1
#define _SMT1PRH_SMT1PR11_MASK                              0x8
#define _SMT1PRH_SMT1PR12_POSN                              0x4
#define _SMT1PRH_SMT1PR12_POSITION                          0x4
#define _SMT1PRH_SMT1PR12_SIZE                              0x1
#define _SMT1PRH_SMT1PR12_LENGTH                            0x1
#define _SMT1PRH_SMT1PR12_MASK                              0x10
#define _SMT1PRH_SMT1PR13_POSN                              0x5
#define _SMT1PRH_SMT1PR13_POSITION                          0x5
#define _SMT1PRH_SMT1PR13_SIZE                              0x1
#define _SMT1PRH_SMT1PR13_LENGTH                            0x1
#define _SMT1PRH_SMT1PR13_MASK                              0x20
#define _SMT1PRH_SMT1PR14_POSN                              0x6
#define _SMT1PRH_SMT1PR14_POSITION                          0x6
#define _SMT1PRH_SMT1PR14_SIZE                              0x1
#define _SMT1PRH_SMT1PR14_LENGTH                            0x1
#define _SMT1PRH_SMT1PR14_MASK                              0x40
#define _SMT1PRH_SMT1PR15_POSN                              0x7
#define _SMT1PRH_SMT1PR15_POSITION                          0x7
#define _SMT1PRH_SMT1PR15_SIZE                              0x1
#define _SMT1PRH_SMT1PR15_LENGTH                            0x1
#define _SMT1PRH_SMT1PR15_MASK                              0x80

// Register: SMT1PRU
#define SMT1PRU SMT1PRU
extern volatile unsigned char           SMT1PRU             __at(0x3F1D);
#ifndef _LIB_BUILD
asm("SMT1PRU equ 03F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PR16                   :1;
        unsigned PR17                   :1;
        unsigned PR18                   :1;
        unsigned PR19                   :1;
        unsigned PR20                   :1;
        unsigned PR21                   :1;
        unsigned PR22                   :1;
        unsigned PR23                   :1;
    };
    struct {
        unsigned SMT1PR                 :8;
    };
    struct {
        unsigned SMT1PR16               :1;
        unsigned SMT1PR17               :1;
        unsigned SMT1PR18               :1;
        unsigned SMT1PR19               :1;
        unsigned SMT1PR20               :1;
        unsigned SMT1PR21               :1;
        unsigned SMT1PR22               :1;
        unsigned SMT1PR23               :1;
    };
} SMT1PRUbits_t;
