GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.h
extern volatile INTCON0bits_t INTCON0bits __at(0x3FD2);
// bitfield macros
#define _INTCON0_INT0EDG_POSN                               0x0
#define _INTCON0_INT0EDG_POSITION                           0x0
#define _INTCON0_INT0EDG_SIZE                               0x1
#define _INTCON0_INT0EDG_LENGTH                             0x1
#define _INTCON0_INT0EDG_MASK                               0x1
#define _INTCON0_INT1EDG_POSN                               0x1
#define _INTCON0_INT1EDG_POSITION                           0x1
#define _INTCON0_INT1EDG_SIZE                               0x1
#define _INTCON0_INT1EDG_LENGTH                             0x1
#define _INTCON0_INT1EDG_MASK                               0x2
#define _INTCON0_INT2EDG_POSN                               0x2
#define _INTCON0_INT2EDG_POSITION                           0x2
#define _INTCON0_INT2EDG_SIZE                               0x1
#define _INTCON0_INT2EDG_LENGTH                             0x1
#define _INTCON0_INT2EDG_MASK                               0x4
#define _INTCON0_IPEN_POSN                                  0x5
#define _INTCON0_IPEN_POSITION                              0x5
#define _INTCON0_IPEN_SIZE                                  0x1
#define _INTCON0_IPEN_LENGTH                                0x1
#define _INTCON0_IPEN_MASK                                  0x20
#define _INTCON0_GIEL_POSN                                  0x6
#define _INTCON0_GIEL_POSITION                              0x6
#define _INTCON0_GIEL_SIZE                                  0x1
#define _INTCON0_GIEL_LENGTH                                0x1
#define _INTCON0_GIEL_MASK                                  0x40
#define _INTCON0_GIE_POSN                                   0x7
#define _INTCON0_GIE_POSITION                               0x7
#define _INTCON0_GIE_SIZE                                   0x1
#define _INTCON0_GIE_LENGTH                                 0x1
#define _INTCON0_GIE_MASK                                   0x80
#define _INTCON0_GIEH_POSN                                  0x7
#define _INTCON0_GIEH_POSITION                              0x7
#define _INTCON0_GIEH_SIZE                                  0x1
#define _INTCON0_GIEH_LENGTH                                0x1
#define _INTCON0_GIEH_MASK                                  0x80

// Register: INTCON1
#define INTCON1 INTCON1
extern volatile unsigned char           INTCON1             __at(0x3FD3);
#ifndef _LIB_BUILD
asm("INTCON1 equ 03FD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned STAT                   :2;
    };
    struct {
        unsigned                        :6;
        unsigned STAT0                  :1;
        unsigned STAT1                  :1;
    };
} INTCON1bits_t;
extern volatile INTCON1bits_t INTCON1bits __at(0x3FD3);
// bitfield macros
#define _INTCON1_STAT_POSN                                  0x6
#define _INTCON1_STAT_POSITION                              0x6
#define _INTCON1_STAT_SIZE                                  0x2
#define _INTCON1_STAT_LENGTH                                0x2
#define _INTCON1_STAT_MASK                                  0xC0
#define _INTCON1_STAT0_POSN                                 0x6
#define _INTCON1_STAT0_POSITION                             0x6
#define _INTCON1_STAT0_SIZE                                 0x1
#define _INTCON1_STAT0_LENGTH                               0x1
#define _INTCON1_STAT0_MASK                                 0x40
#define _INTCON1_STAT1_POSN                                 0x7
#define _INTCON1_STAT1_POSITION                             0x7
#define _INTCON1_STAT1_SIZE                                 0x1
#define _INTCON1_STAT1_LENGTH                               0x1
#define _INTCON1_STAT1_MASK                                 0x80

// Register: IVTLOCK
#define IVTLOCK IVTLOCK
extern volatile unsigned char           IVTLOCK             __at(0x3FD4);
#ifndef _LIB_BUILD
asm("IVTLOCK equ 03FD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IVTLOCKED              :1;
    };
} IVTLOCKbits_t;
extern volatile IVTLOCKbits_t IVTLOCKbits __at(0x3FD4);
// bitfield macros
#define _IVTLOCK_IVTLOCKED_POSN                             0x0
#define _IVTLOCK_IVTLOCKED_POSITION                         0x0
#define _IVTLOCK_IVTLOCKED_SIZE                             0x1
#define _IVTLOCK_IVTLOCKED_LENGTH                           0x1
#define _IVTLOCK_IVTLOCKED_MASK                             0x1

// Register: IVTBASE
#define IVTBASE IVTBASE
#ifndef __CCI__
extern volatile __uint24                IVTBASE             __at(0x3FD5);
#endif
#ifndef _LIB_BUILD
asm("IVTBASE equ 03FD5h");
#endif

// Register: IVTBASEL
#define IVTBASEL IVTBASEL
extern volatile unsigned char           IVTBASEL            __at(0x3FD5);
#ifndef _LIB_BUILD
asm("IVTBASEL equ 03FD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BASE0                  :1;
        unsigned BASE1                  :1;
        unsigned BASE2                  :1;
        unsigned BASE3                  :1;
        unsigned BASE4                  :1;
        unsigned BASE5                  :1;
        unsigned BASE6                  :1;
        unsigned BASE7                  :1;
    };
} IVTBASELbits_t;
extern volatile IVTBASELbits_t IVTBASELbits __at(0x3FD5);
// bitfield macros
#define _IVTBASEL_BASE0_POSN                                0x0
#define _IVTBASEL_BASE0_POSITION                            0x0
#define _IVTBASEL_BASE0_SIZE                                0x1
#define _IVTBASEL_BASE0_LENGTH                              0x1
#define _IVTBASEL_BASE0_MASK                                0x1
#define _IVTBASEL_BASE1_POSN                                0x1
#define _IVTBASEL_BASE1_POSITION                            0x1
#define _IVTBASEL_BASE1_SIZE                                0x1
#define _IVTBASEL_BASE1_LENGTH                              0x1
#define _IVTBASEL_BASE1_MASK                                0x2
#define _IVTBASEL_BASE2_POSN                                0x2
#define _IVTBASEL_BASE2_POSITION                            0x2
#define _IVTBASEL_BASE2_SIZE                                0x1
#define _IVTBASEL_BASE2_LENGTH                              0x1
#define _IVTBASEL_BASE2_MASK                                0x4
#define _IVTBASEL_BASE3_POSN                                0x3
#define _IVTBASEL_BASE3_POSITION                            0x3
#define _IVTBASEL_BASE3_SIZE                                0x1
#define _IVTBASEL_BASE3_LENGTH                              0x1
#define _IVTBASEL_BASE3_MASK                                0x8
#define _IVTBASEL_BASE4_POSN                                0x4
#define _IVTBASEL_BASE4_POSITION                            0x4
#define _IVTBASEL_BASE4_SIZE                                0x1
#define _IVTBASEL_BASE4_LENGTH                              0x1
#define _IVTBASEL_BASE4_MASK                                0x10
#define _IVTBASEL_BASE5_POSN                                0x5
#define _IVTBASEL_BASE5_POSITION                            0x5
#define _IVTBASEL_BASE5_SIZE                                0x1
#define _IVTBASEL_BASE5_LENGTH                              0x1
#define _IVTBASEL_BASE5_MASK                                0x20
#define _IVTBASEL_BASE6_POSN                                0x6
#define _IVTBASEL_BASE6_POSITION                            0x6
#define _IVTBASEL_BASE6_SIZE                                0x1
#define _IVTBASEL_BASE6_LENGTH                              0x1
#define _IVTBASEL_BASE6_MASK                                0x40
#define _IVTBASEL_BASE7_POSN                                0x7
#define _IVTBASEL_BASE7_POSITION                            0x7
#define _IVTBASEL_BASE7_SIZE                                0x1
#define _IVTBASEL_BASE7_LENGTH                              0x1
#define _IVTBASEL_BASE7_MASK                                0x80

