GopalSaraf/Practicals/PSDL/include/proc/pic18lf47k42.h
extern volatile __bit                   DMA2EN              __at(0x1DEE7);	// @ (0x3BDC * 8 + 7)
#define                                 DMA2EN_bit          _BIT_ACCESS(DMA2CON0,7)
// PMD7<DMA2MD>
extern volatile __bit                   DMA2MD              __at(0x1CE39);	// @ (0x39C7 * 8 + 1)
#define                                 DMA2MD_bit          _BIT_ACCESS(PMD7,1)
// PIE5<DMA2ORIE>
extern volatile __bit                   DMA2ORIE            __at(0x1CCAC);	// @ (0x3995 * 8 + 4)
#define                                 DMA2ORIE_bit        _BIT_ACCESS(PIE5,4)
// PIR5<DMA2ORIF>
extern volatile __bit                   DMA2ORIF            __at(0x1CD2C);	// @ (0x39A5 * 8 + 4)
#define                                 DMA2ORIF_bit        _BIT_ACCESS(PIR5,4)
// IPR5<DMA2ORIP>
extern volatile __bit                   DMA2ORIP            __at(0x1CC2C);	// @ (0x3985 * 8 + 4)
#define                                 DMA2ORIP_bit        _BIT_ACCESS(IPR5,4)
// DMA2PR<DMA2PR0>
extern volatile __bit                   DMA2PR0             __at(0x1CFA0);	// @ (0x39F4 * 8 + 0)
#define                                 DMA2PR0_bit         _BIT_ACCESS(DMA2PR,0)
// DMA2PR<DMA2PR1>
extern volatile __bit                   DMA2PR1             __at(0x1CFA1);	// @ (0x39F4 * 8 + 1)
#define                                 DMA2PR1_bit         _BIT_ACCESS(DMA2PR,1)
// DMA2PR<DMA2PR2>
extern volatile __bit                   DMA2PR2             __at(0x1CFA2);	// @ (0x39F4 * 8 + 2)
#define                                 DMA2PR2_bit         _BIT_ACCESS(DMA2PR,2)
// DMA2SCNTL<DMA2SCNT0>
extern volatile __bit                   DMA2SCNT0           __at(0x1DE90);	// @ (0x3BD2 * 8 + 0)
#define                                 DMA2SCNT0_bit       _BIT_ACCESS(DMA2SCNTL,0)
// DMA2SCNTL<DMA2SCNT1>
extern volatile __bit                   DMA2SCNT1           __at(0x1DE91);	// @ (0x3BD2 * 8 + 1)
#define                                 DMA2SCNT1_bit       _BIT_ACCESS(DMA2SCNTL,1)
// DMA2SCNTH<DMA2SCNT10>
extern volatile __bit                   DMA2SCNT10          __at(0x1DE9A);	// @ (0x3BD3 * 8 + 2)
#define                                 DMA2SCNT10_bit      _BIT_ACCESS(DMA2SCNTH,2)
// DMA2SCNTH<DMA2SCNT11>
extern volatile __bit                   DMA2SCNT11          __at(0x1DE9B);	// @ (0x3BD3 * 8 + 3)
#define                                 DMA2SCNT11_bit      _BIT_ACCESS(DMA2SCNTH,3)
// DMA2SCNTL<DMA2SCNT2>
extern volatile __bit                   DMA2SCNT2           __at(0x1DE92);	// @ (0x3BD2 * 8 + 2)
#define                                 DMA2SCNT2_bit       _BIT_ACCESS(DMA2SCNTL,2)
// DMA2SCNTL<DMA2SCNT3>
extern volatile __bit                   DMA2SCNT3           __at(0x1DE93);	// @ (0x3BD2 * 8 + 3)
#define                                 DMA2SCNT3_bit       _BIT_ACCESS(DMA2SCNTL,3)
// DMA2SCNTL<DMA2SCNT4>
extern volatile __bit                   DMA2SCNT4           __at(0x1DE94);	// @ (0x3BD2 * 8 + 4)
#define                                 DMA2SCNT4_bit       _BIT_ACCESS(DMA2SCNTL,4)
// DMA2SCNTL<DMA2SCNT5>
extern volatile __bit                   DMA2SCNT5           __at(0x1DE95);	// @ (0x3BD2 * 8 + 5)
#define                                 DMA2SCNT5_bit       _BIT_ACCESS(DMA2SCNTL,5)
// DMA2SCNTL<DMA2SCNT6>
extern volatile __bit                   DMA2SCNT6           __at(0x1DE96);	// @ (0x3BD2 * 8 + 6)
#define                                 DMA2SCNT6_bit       _BIT_ACCESS(DMA2SCNTL,6)
// DMA2SCNTL<DMA2SCNT7>
extern volatile __bit                   DMA2SCNT7           __at(0x1DE97);	// @ (0x3BD2 * 8 + 7)
#define                                 DMA2SCNT7_bit       _BIT_ACCESS(DMA2SCNTL,7)
// DMA2SCNTH<DMA2SCNT8>
extern volatile __bit                   DMA2SCNT8           __at(0x1DE98);	// @ (0x3BD3 * 8 + 0)
#define                                 DMA2SCNT8_bit       _BIT_ACCESS(DMA2SCNTH,0)
// DMA2SCNTH<DMA2SCNT9>
extern volatile __bit                   DMA2SCNT9           __at(0x1DE99);	// @ (0x3BD3 * 8 + 1)
#define                                 DMA2SCNT9_bit       _BIT_ACCESS(DMA2SCNTH,1)
// PIE5<DMA2SCNTIE>
extern volatile __bit                   DMA2SCNTIE          __at(0x1CCAA);	// @ (0x3995 * 8 + 2)
#define                                 DMA2SCNTIE_bit      _BIT_ACCESS(PIE5,2)
// PIR5<DMA2SCNTIF>
extern volatile __bit                   DMA2SCNTIF          __at(0x1CD2A);	// @ (0x39A5 * 8 + 2)
#define                                 DMA2SCNTIF_bit      _BIT_ACCESS(PIR5,2)
// IPR5<DMA2SCNTIP>
extern volatile __bit                   DMA2SCNTIP          __at(0x1CC2A);	// @ (0x3985 * 8 + 2)
#define                                 DMA2SCNTIP_bit      _BIT_ACCESS(IPR5,2)
// DMA2SIRQ<DMA2SIRQ0>
extern volatile __bit                   DMA2SIRQ0           __at(0x1DEF8);	// @ (0x3BDF * 8 + 0)
#define                                 DMA2SIRQ0_bit       _BIT_ACCESS(DMA2SIRQ,0)
// DMA2SIRQ<DMA2SIRQ1>
extern volatile __bit                   DMA2SIRQ1           __at(0x1DEF9);	// @ (0x3BDF * 8 + 1)
#define                                 DMA2SIRQ1_bit       _BIT_ACCESS(DMA2SIRQ,1)
// DMA2SIRQ<DMA2SIRQ2>
extern volatile __bit                   DMA2SIRQ2           __at(0x1DEFA);	// @ (0x3BDF * 8 + 2)
#define                                 DMA2SIRQ2_bit       _BIT_ACCESS(DMA2SIRQ,2)
// DMA2SIRQ<DMA2SIRQ3>
extern volatile __bit                   DMA2SIRQ3           __at(0x1DEFB);	// @ (0x3BDF * 8 + 3)
#define                                 DMA2SIRQ3_bit       _BIT_ACCESS(DMA2SIRQ,3)
// DMA2SIRQ<DMA2SIRQ4>
extern volatile __bit                   DMA2SIRQ4           __at(0x1DEFC);	// @ (0x3BDF * 8 + 4)
#define                                 DMA2SIRQ4_bit       _BIT_ACCESS(DMA2SIRQ,4)
// DMA2SIRQ<DMA2SIRQ5>
extern volatile __bit                   DMA2SIRQ5           __at(0x1DEFD);	// @ (0x3BDF * 8 + 5)
#define                                 DMA2SIRQ5_bit       _BIT_ACCESS(DMA2SIRQ,5)
// DMA2SIRQ<DMA2SIRQ6>
extern volatile __bit                   DMA2SIRQ6           __at(0x1DEFE);	// @ (0x3BDF * 8 + 6)
#define                                 DMA2SIRQ6_bit       _BIT_ACCESS(DMA2SIRQ,6)
// DMA2CON0<DMA2SIRQEN>
extern volatile __bit                   DMA2SIRQEN          __at(0x1DEE6);	// @ (0x3BDC * 8 + 6)
#define                                 DMA2SIRQEN_bit      _BIT_ACCESS(DMA2CON0,6)
// DMA2SPTRL<DMA2SPTR0>
extern volatile __bit                   DMA2SPTR0           __at(0x1DEA0);	// @ (0x3BD4 * 8 + 0)
#define                                 DMA2SPTR0_bit       _BIT_ACCESS(DMA2SPTRL,0)
// DMA2SPTRL<DMA2SPTR1>
extern volatile __bit                   DMA2SPTR1           __at(0x1DEA1);	// @ (0x3BD4 * 8 + 1)
#define                                 DMA2SPTR1_bit       _BIT_ACCESS(DMA2SPTRL,1)
// DMA2SPTRH<DMA2SPTR10>
extern volatile __bit                   DMA2SPTR10          __at(0x1DEAA);	// @ (0x3BD5 * 8 + 2)
#define                                 DMA2SPTR10_bit      _BIT_ACCESS(DMA2SPTRH,2)
// DMA2SPTRH<DMA2SPTR11>
extern volatile __bit                   DMA2SPTR11          __at(0x1DEAB);	// @ (0x3BD5 * 8 + 3)
#define                                 DMA2SPTR11_bit      _BIT_ACCESS(DMA2SPTRH,3)
// DMA2SPTRH<DMA2SPTR12>
extern volatile __bit                   DMA2SPTR12          __at(0x1DEAC);	// @ (0x3BD5 * 8 + 4)
#define                                 DMA2SPTR12_bit      _BIT_ACCESS(DMA2SPTRH,4)
// DMA2SPTRH<DMA2SPTR13>
extern volatile __bit                   DMA2SPTR13          __at(0x1DEAD);	// @ (0x3BD5 * 8 + 5)
#define                                 DMA2SPTR13_bit      _BIT_ACCESS(DMA2SPTRH,5)
// DMA2SPTRH<DMA2SPTR14>
extern volatile __bit                   DMA2SPTR14          __at(0x1DEAE);	// @ (0x3BD5 * 8 + 6)
#define                                 DMA2SPTR14_bit      _BIT_ACCESS(DMA2SPTRH,6)
// DMA2SPTRH<DMA2SPTR15>
extern volatile __bit                   DMA2SPTR15          __at(0x1DEAF);	// @ (0x3BD5 * 8 + 7)
#define                                 DMA2SPTR15_bit      _BIT_ACCESS(DMA2SPTRH,7)
// DMA2SPTRU<DMA2SPTR16>
extern volatile __bit                   DMA2SPTR16          __at(0x1DEB0);	// @ (0x3BD6 * 8 + 0)
#define                                 DMA2SPTR16_bit      _BIT_ACCESS(DMA2SPTRU,0)
// DMA2SPTRU<DMA2SPTR17>
extern volatile __bit                   DMA2SPTR17          __at(0x1DEB1);	// @ (0x3BD6 * 8 + 1)
#define                                 DMA2SPTR17_bit      _BIT_ACCESS(DMA2SPTRU,1)
// DMA2SPTRU<DMA2SPTR18>
extern volatile __bit                   DMA2SPTR18          __at(0x1DEB2);	// @ (0x3BD6 * 8 + 2)
#define                                 DMA2SPTR18_bit      _BIT_ACCESS(DMA2SPTRU,2)
// DMA2SPTRU<DMA2SPTR19>
extern volatile __bit                   DMA2SPTR19          __at(0x1DEB3);	// @ (0x3BD6 * 8 + 3)
#define                                 DMA2SPTR19_bit      _BIT_ACCESS(DMA2SPTRU,3)
// DMA2SPTRL<DMA2SPTR2>
extern volatile __bit                   DMA2SPTR2           __at(0x1DEA2);	// @ (0x3BD4 * 8 + 2)
#define                                 DMA2SPTR2_bit       _BIT_ACCESS(DMA2SPTRL,2)
// DMA2SPTRU<DMA2SPTR20>
extern volatile __bit                   DMA2SPTR20          __at(0x1DEB4);	// @ (0x3BD6 * 8 + 4)
#define                                 DMA2SPTR20_bit      _BIT_ACCESS(DMA2SPTRU,4)
// DMA2SPTRU<DMA2SPTR21>
extern volatile __bit                   DMA2SPTR21          __at(0x1DEB5);	// @ (0x3BD6 * 8 + 5)
#define                                 DMA2SPTR21_bit      _BIT_ACCESS(DMA2SPTRU,5)
// DMA2SPTRL<DMA2SPTR3>
extern volatile __bit                   DMA2SPTR3           __at(0x1DEA3);	// @ (0x3BD4 * 8 + 3)
#define                                 DMA2SPTR3_bit       _BIT_ACCESS(DMA2SPTRL,3)
// DMA2SPTRL<DMA2SPTR4>
extern volatile __bit                   DMA2SPTR4           __at(0x1DEA4);	// @ (0x3BD4 * 8 + 4)
#define                                 DMA2SPTR4_bit       _BIT_ACCESS(DMA2SPTRL,4)
// DMA2SPTRL<DMA2SPTR5>
extern volatile __bit                   DMA2SPTR5           __at(0x1DEA5);	// @ (0x3BD4 * 8 + 5)
#define                                 DMA2SPTR5_bit       _BIT_ACCESS(DMA2SPTRL,5)
// DMA2SPTRL<DMA2SPTR6>
extern volatile __bit                   DMA2SPTR6           __at(0x1DEA6);	// @ (0x3BD4 * 8 + 6)
#define                                 DMA2SPTR6_bit       _BIT_ACCESS(DMA2SPTRL,6)
// DMA2SPTRL<DMA2SPTR7>
extern volatile __bit                   DMA2SPTR7           __at(0x1DEA7);	// @ (0x3BD4 * 8 + 7)
#define                                 DMA2SPTR7_bit       _BIT_ACCESS(DMA2SPTRL,7)
// DMA2SPTRH<DMA2SPTR8>
extern volatile __bit                   DMA2SPTR8           __at(0x1DEA8);	// @ (0x3BD5 * 8 + 0)
#define                                 DMA2SPTR8_bit       _BIT_ACCESS(DMA2SPTRH,0)
// DMA2SPTRH<DMA2SPTR9>
extern volatile __bit                   DMA2SPTR9           __at(0x1DEA9);	// @ (0x3BD5 * 8 + 1)
#define                                 DMA2SPTR9_bit       _BIT_ACCESS(DMA2SPTRH,1)
// DMA2SSAL<DMA2SSA0>
extern volatile __bit                   DMA2SSA0            __at(0x1DEC8);	// @ (0x3BD9 * 8 + 0)
#define                                 DMA2SSA0_bit        _BIT_ACCESS(DMA2SSAL,0)
// DMA2SSAL<DMA2SSA1>
extern volatile __bit                   DMA2SSA1            __at(0x1DEC9);	// @ (0x3BD9 * 8 + 1)
#define                                 DMA2SSA1_bit        _BIT_ACCESS(DMA2SSAL,1)
// DMA2SSAH<DMA2SSA10>
extern volatile __bit                   DMA2SSA10           __at(0x1DED2);	// @ (0x3BDA * 8 + 2)
#define                                 DMA2SSA10_bit       _BIT_ACCESS(DMA2SSAH,2)
// DMA2SSAH<DMA2SSA11>
extern volatile __bit                   DMA2SSA11           __at(0x1DED3);	// @ (0x3BDA * 8 + 3)
#define                                 DMA2SSA11_bit       _BIT_ACCESS(DMA2SSAH,3)
// DMA2SSAH<DMA2SSA12>
extern volatile __bit                   DMA2SSA12           __at(0x1DED4);	// @ (0x3BDA * 8 + 4)
#define                                 DMA2SSA12_bit       _BIT_ACCESS(DMA2SSAH,4)
// DMA2SSAH<DMA2SSA13>
extern volatile __bit                   DMA2SSA13           __at(0x1DED5);	// @ (0x3BDA * 8 + 5)
#define                                 DMA2SSA13_bit       _BIT_ACCESS(DMA2SSAH,5)
// DMA2SSAH<DMA2SSA14>
extern volatile __bit                   DMA2SSA14           __at(0x1DED6);	// @ (0x3BDA * 8 + 6)
#define                                 DMA2SSA14_bit       _BIT_ACCESS(DMA2SSAH,6)
// DMA2SSAH<DMA2SSA15>
extern volatile __bit                   DMA2SSA15           __at(0x1DED7);	// @ (0x3BDA * 8 + 7)
#define                                 DMA2SSA15_bit       _BIT_ACCESS(DMA2SSAH,7)
// DMA2SSAU<DMA2SSA16>
extern volatile __bit                   DMA2SSA16           __at(0x1DED8);	// @ (0x3BDB * 8 + 0)
#define                                 DMA2SSA16_bit       _BIT_ACCESS(DMA2SSAU,0)
// DMA2SSAU<DMA2SSA17>
extern volatile __bit                   DMA2SSA17           __at(0x1DED9);	// @ (0x3BDB * 8 + 1)
#define                                 DMA2SSA17_bit       _BIT_ACCESS(DMA2SSAU,1)
// DMA2SSAU<DMA2SSA18>
extern volatile __bit                   DMA2SSA18           __at(0x1DEDA);	// @ (0x3BDB * 8 + 2)
#define                                 DMA2SSA18_bit       _BIT_ACCESS(DMA2SSAU,2)
// DMA2SSAU<DMA2SSA19>
extern volatile __bit                   DMA2SSA19           __at(0x1DEDB);	// @ (0x3BDB * 8 + 3)
#define                                 DMA2SSA19_bit       _BIT_ACCESS(DMA2SSAU,3)
// DMA2SSAL<DMA2SSA2>
extern volatile __bit                   DMA2SSA2            __at(0x1DECA);	// @ (0x3BD9 * 8 + 2)
#define                                 DMA2SSA2_bit        _BIT_ACCESS(DMA2SSAL,2)
// DMA2SSAU<DMA2SSA20>
extern volatile __bit                   DMA2SSA20           __at(0x1DEDC);	// @ (0x3BDB * 8 + 4)
#define                                 DMA2SSA20_bit       _BIT_ACCESS(DMA2SSAU,4)
// DMA2SSAU<DMA2SSA21>
extern volatile __bit                   DMA2SSA21           __at(0x1DEDD);	// @ (0x3BDB * 8 + 5)
#define                                 DMA2SSA21_bit       _BIT_ACCESS(DMA2SSAU,5)
// DMA2SSAL<DMA2SSA3>
extern volatile __bit                   DMA2SSA3            __at(0x1DECB);	// @ (0x3BD9 * 8 + 3)
#define                                 DMA2SSA3_bit        _BIT_ACCESS(DMA2SSAL,3)
// DMA2SSAL<DMA2SSA4>
extern volatile __bit                   DMA2SSA4            __at(0x1DECC);	// @ (0x3BD9 * 8 + 4)
#define                                 DMA2SSA4_bit        _BIT_ACCESS(DMA2SSAL,4)
// DMA2SSAL<DMA2SSA5>
extern volatile __bit                   DMA2SSA5            __at(0x1DECD);	// @ (0x3BD9 * 8 + 5)
#define                                 DMA2SSA5_bit        _BIT_ACCESS(DMA2SSAL,5)
// DMA2SSAL<DMA2SSA6>
extern volatile __bit                   DMA2SSA6            __at(0x1DECE);	// @ (0x3BD9 * 8 + 6)
#define                                 DMA2SSA6_bit        _BIT_ACCESS(DMA2SSAL,6)
// DMA2SSAL<DMA2SSA7>
extern volatile __bit                   DMA2SSA7            __at(0x1DECF);	// @ (0x3BD9 * 8 + 7)
#define                                 DMA2SSA7_bit        _BIT_ACCESS(DMA2SSAL,7)
// DMA2SSAH<DMA2SSA8>
extern volatile __bit                   DMA2SSA8            __at(0x1DED0);	// @ (0x3BDA * 8 + 0)
#define                                 DMA2SSA8_bit        _BIT_ACCESS(DMA2SSAH,0)
// DMA2SSAH<DMA2SSA9>
extern volatile __bit                   DMA2SSA9            __at(0x1DED1);	// @ (0x3BDA * 8 + 1)
#define                                 DMA2SSA9_bit        _BIT_ACCESS(DMA2SSAH,1)
// DMA2SSZL<DMA2SSZ0>
extern volatile __bit                   DMA2SSZ0            __at(0x1DEB8);	// @ (0x3BD7 * 8 + 0)
#define                                 DMA2SSZ0_bit        _BIT_ACCESS(DMA2SSZL,0)
// DMA2SSZL<DMA2SSZ1>
extern volatile __bit                   DMA2SSZ1            __at(0x1DEB9);	// @ (0x3BD7 * 8 + 1)
#define                                 DMA2SSZ1_bit        _BIT_ACCESS(DMA2SSZL,1)
// DMA2SSZH<DMA2SSZ10>
extern volatile __bit                   DMA2SSZ10           __at(0x1DEC2);	// @ (0x3BD8 * 8 + 2)
#define                                 DMA2SSZ10_bit       _BIT_ACCESS(DMA2SSZH,2)
// DMA2SSZH<DMA2SSZ11>
extern volatile __bit                   DMA2SSZ11           __at(0x1DEC3);	// @ (0x3BD8 * 8 + 3)
#define                                 DMA2SSZ11_bit       _BIT_ACCESS(DMA2SSZH,3)
// DMA2SSZL<DMA2SSZ2>
extern volatile __bit                   DMA2SSZ2            __at(0x1DEBA);	// @ (0x3BD7 * 8 + 2)
#define                                 DMA2SSZ2_bit        _BIT_ACCESS(DMA2SSZL,2)
// DMA2SSZL<DMA2SSZ3>
extern volatile __bit                   DMA2SSZ3            __at(0x1DEBB);	// @ (0x3BD7 * 8 + 3)
#define                                 DMA2SSZ3_bit        _BIT_ACCESS(DMA2SSZL,3)
// DMA2SSZL<DMA2SSZ4>
extern volatile __bit                   DMA2SSZ4            __at(0x1DEBC);	// @ (0x3BD7 * 8 + 4)
#define                                 DMA2SSZ4_bit        _BIT_ACCESS(DMA2SSZL,4)
// DMA2SSZL<DMA2SSZ5>
extern volatile __bit                   DMA2SSZ5            __at(0x1DEBD);	// @ (0x3BD7 * 8 + 5)
#define                                 DMA2SSZ5_bit        _BIT_ACCESS(DMA2SSZL,5)
// DMA2SSZL<DMA2SSZ6>
extern volatile __bit                   DMA2SSZ6            __at(0x1DEBE);	// @ (0x3BD7 * 8 + 6)
#define                                 DMA2SSZ6_bit        _BIT_ACCESS(DMA2SSZL,6)
// DMA2SSZL<DMA2SSZ7>
extern volatile __bit                   DMA2SSZ7            __at(0x1DEBF);	// @ (0x3BD7 * 8 + 7)
#define                                 DMA2SSZ7_bit        _BIT_ACCESS(DMA2SSZL,7)
// DMA2SSZH<DMA2SSZ8>
extern volatile __bit                   DMA2SSZ8            __at(0x1DEC0);	// @ (0x3BD8 * 8 + 0)
#define                                 DMA2SSZ8_bit        _BIT_ACCESS(DMA2SSZH,0)
// DMA2SSZH<DMA2SSZ9>
extern volatile __bit                   DMA2SSZ9            __at(0x1DEC1);	// @ (0x3BD8 * 8 + 1)
#define                                 DMA2SSZ9_bit        _BIT_ACCESS(DMA2SSZH,1)
// DMA2CON0<DMA2XIP>
extern volatile __bit                   DMA2XIP             __at(0x1DEE0);	// @ (0x3BDC * 8 + 0)
#define                                 DMA2XIP_bit         _BIT_ACCESS(DMA2CON0,0)
// CPUDOZE<DOE>
extern volatile __bit                   DOE                 __at(0x1CEC4);	// @ (0x39D8 * 8 + 4)
#define                                 DOE_bit             _BIT_ACCESS(CPUDOZE,4)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x1F7C0);	// @ (0x3EF8 * 8 + 0)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,0)
// CPUDOZE<DOZE0>
extern volatile __bit                   DOZE0               __at(0x1CEC0);	// @ (0x39D8 * 8 + 0)
#define                                 DOZE0_bit           _BIT_ACCESS(CPUDOZE,0)
// CPUDOZE<DOZE1>
extern volatile __bit                   DOZE1               __at(0x1CEC1);	// @ (0x39D8 * 8 + 1)
#define                                 DOZE1_bit           _BIT_ACCESS(CPUDOZE,1)
// CPUDOZE<DOZE2>
extern volatile __bit                   DOZE2               __at(0x1CEC2);	// @ (0x39D8 * 8 + 2)
#define                                 DOZE2_bit           _BIT_ACCESS(CPUDOZE,2)
// CPUDOZE<DOZEN>
extern volatile __bit                   DOZEN               __at(0x1CEC6);	// @ (0x39D8 * 8 + 6)
#define                                 DOZEN_bit           _BIT_ACCESS(CPUDOZE,6)
// ADCON1<DSEN>
extern volatile __bit                   DSEN                __at(0x1F7C8);	// @ (0x3EF9 * 8 + 0)
#define                                 DSEN_bit            _BIT_ACCESS(ADCON1,0)
// PMD6<DSMMD>
extern volatile __bit                   DSMMD               __at(0x1CE30);	// @ (0x39C6 * 8 + 0)
#define                                 DSMMD_bit           _BIT_ACCESS(PMD6,0)
// SPI1INTE<EOSIE>
extern volatile __bit                   EOSIE               __at(0x1E8DC);	// @ (0x3D1B * 8 + 4)
#define                                 EOSIE_bit           _BIT_ACCESS(SPI1INTE,4)
// SPI1INTF<EOSIF>
extern volatile __bit                   EOSIF               __at(0x1E8D4);	// @ (0x3D1A * 8 + 4)
#define                                 EOSIF_bit           _BIT_ACCESS(SPI1INTF,4)
// ADERRL<ERR0>
extern volatile __bit                   ERR0                __at(0x1F710);	// @ (0x3EE2 * 8 + 0)
#define                                 ERR0_bit            _BIT_ACCESS(ADERRL,0)
// ADERRL<ERR1>
extern volatile __bit                   ERR1                __at(0x1F711);	// @ (0x3EE2 * 8 + 1)
#define                                 ERR1_bit            _BIT_ACCESS(ADERRL,1)
// ADERRH<ERR10>
extern volatile __bit                   ERR10               __at(0x1F71A);	// @ (0x3EE3 * 8 + 2)
#define                                 ERR10_bit           _BIT_ACCESS(ADERRH,2)
// ADERRH<ERR11>
extern volatile __bit                   ERR11               __at(0x1F71B);	// @ (0x3EE3 * 8 + 3)
#define                                 ERR11_bit           _BIT_ACCESS(ADERRH,3)
// ADERRH<ERR12>
extern volatile __bit                   ERR12               __at(0x1F71C);	// @ (0x3EE3 * 8 + 4)
#define                                 ERR12_bit           _BIT_ACCESS(ADERRH,4)
// ADERRH<ERR13>
extern volatile __bit                   ERR13               __at(0x1F71D);	// @ (0x3EE3 * 8 + 5)
#define                                 ERR13_bit           _BIT_ACCESS(ADERRH,5)
// ADERRH<ERR14>
extern volatile __bit                   ERR14               __at(0x1F71E);	// @ (0x3EE3 * 8 + 6)
#define                                 ERR14_bit           _BIT_ACCESS(ADERRH,6)
// ADERRH<ERR15>
extern volatile __bit                   ERR15               __at(0x1F71F);	// @ (0x3EE3 * 8 + 7)
#define                                 ERR15_bit           _BIT_ACCESS(ADERRH,7)
// ADERRL<ERR2>
extern volatile __bit                   ERR2                __at(0x1F712);	// @ (0x3EE2 * 8 + 2)
#define                                 ERR2_bit            _BIT_ACCESS(ADERRL,2)
// ADERRL<ERR3>
extern volatile __bit                   ERR3                __at(0x1F713);	// @ (0x3EE2 * 8 + 3)
#define                                 ERR3_bit            _BIT_ACCESS(ADERRL,3)
// ADERRL<ERR4>
extern volatile __bit                   ERR4                __at(0x1F714);	// @ (0x3EE2 * 8 + 4)
#define                                 ERR4_bit            _BIT_ACCESS(ADERRL,4)
// ADERRL<ERR5>
extern volatile __bit                   ERR5                __at(0x1F715);	// @ (0x3EE2 * 8 + 5)
#define                                 ERR5_bit            _BIT_ACCESS(ADERRL,5)
// ADERRL<ERR6>
extern volatile __bit                   ERR6                __at(0x1F716);	// @ (0x3EE2 * 8 + 6)
#define                                 ERR6_bit            _BIT_ACCESS(ADERRL,6)
// ADERRL<ERR7>
extern volatile __bit                   ERR7                __at(0x1F717);	// @ (0x3EE2 * 8 + 7)
#define                                 ERR7_bit            _BIT_ACCESS(ADERRL,7)
// ADERRH<ERR8>
extern volatile __bit                   ERR8                __at(0x1F718);	// @ (0x3EE3 * 8 + 0)
#define                                 ERR8_bit            _BIT_ACCESS(ADERRH,0)
// ADERRH<ERR9>
extern volatile __bit                   ERR9                __at(0x1F719);	// @ (0x3EE3 * 8 + 1)
#define                                 ERR9_bit            _BIT_ACCESS(ADERRH,1)
// OSCEN<EXTOEN>
extern volatile __bit                   EXTOEN              __at(0x1CEEF);	// @ (0x39DD * 8 + 7)
#define                                 EXTOEN_bit          _BIT_ACCESS(OSCEN,7)
// OSCSTAT<EXTOR>
extern volatile __bit                   EXTOR               __at(0x1CEE7);	// @ (0x39DC * 8 + 7)
#define                                 EXTOR_bit           _BIT_ACCESS(OSCSTAT,7)
// ADFLTRL<FLTR0>
extern volatile __bit                   FLTR0               __at(0x1F730);	// @ (0x3EE6 * 8 + 0)
#define                                 FLTR0_bit           _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<FLTR1>
extern volatile __bit                   FLTR1               __at(0x1F731);	// @ (0x3EE6 * 8 + 1)
#define                                 FLTR1_bit           _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<FLTR10>
extern volatile __bit                   FLTR10              __at(0x1F73A);	// @ (0x3EE7 * 8 + 2)
#define                                 FLTR10_bit          _BIT_ACCESS(ADFLTRH,2)
